-------Дневник выполнения-------
(+) - сделано
(-) - решено не делать
(?) - еще не проработано
(!!!) - пока это не сделано, дальше не идти
--------------------------------
1)+ Месяц должен бы автоматически прокручиваться при попытке выйти за пределы текущего (вверх - вниз)
2)+ При выборе с клавиатуры нужен курсор - текущая, но не выбранная ячейка - 
    выбор осуществляется нажатием на спец клавишу (энтер или пробел)
3)+ Быстрый переход по годам и месяцам с помощью клавиатуры (хом, энд, страница вверх и вниз)
4)- Продумать наличие графических элементов (в смысле картинок) - продумал - потом сделаю :)
5)- Скачек на заданное количество дней (месяцев, лет) вперед и назад
6)+ Функцию селект нужно переписать для заданной даты
7)+ Написать объект, хранящий настройки визуализации каждой ячейки
9)- Период-то хранить в соответствующем объекте, но одну - в другом с тем же интерфейсом
10) + Свойство: "Автоматическая прокрутка"
11) + Свойство: "Внешний вид ячейки". Графический редактор представления ячейки
12) + Свойство: "Доступен для редактирования" 
13) + Свойство: "Отображать дни соседнего месяца"
14) + Свойство: "Даты по умолчанию"
15) + Свойство: "Запрещенные даты" (дополнение к периоду)
16) + Отказаться от трехмерной ячейки - обойтись простой и границей (линией)
17) + Написать редактор шрифтов
18) - Возможно не стоит компонент наследовать от представления
19) + Написать редактор границ
20) + Реализовать возможность выбора отсутствия границы
21) - Свойство: цвет фона
22) + Сервисный класс с готовыми диалогами выбора шрифта, границы, даты (сделал EditorDialog - 
    нужный редактор передается в конструкторе)
23) + Три варианта выбора дат: одна, период, мульти
24) + Редактор интерфейса, профилей (добавление, удаление, сохранение)
25) + !!! Интернационализация !!!
26) - Обновление одних свойств при изменении других (профили внешнего вида)
27) - Кеширование в диалоговых окнах редакторов свойств
28) + Возможность выбора пустой даты
29) + Создание дополнительной панели: кнопки прокрутки месяца и года, п. 28, 
30) + Создание класса - рисовальщика ячеек.
31) - Отделить код компонента (бина) от класса - выборщика даты (для ручного программирования)
32) + Обработка событий
33) + Убрать к чертям DoublePeriodForbid (в PeriodSet добавить поле forbidden)
    (в последствии это вообще убрал)
34) - Отображение последней выбранной (или даты под курсором)
35) ? Добавить часики снизу для выбора времени
36) ? Для ограничений и запрещений опционально добавить время (иначе дату запрещаем, 
    начиная с 00:00 и заканчивая в 23:59:59), при выборе периода середину закрыть
37) - Свойство: время внутри периода (по умолчанию такой выбор запретить) (см п. 36)
38) - Разрешать редактирование времени только для режимов "Период" и "Сингл" (см п. 36)
39) + Создать абстрактный класс "Редактор с кешируемой панелью"
40) + Свойство "Заблокировано" (курсор бродит, прокручивается и все) (просто добавить в модель)
41) + Баг: сучие несовместимые периоды не работают... может связанные события? 
    (решение - хрен с ними, сделал проверку после редактирования)
42) + Баг: внешнее представление не сохраняется в яве.
43) + Баг: выбор одной даты не обновляет
44) ? Сделать одновременное отображение нескольких месяцев
45) + Заголовок для диалогового окна
46) - Попробовать картинку для выпадающего списка вытянуть из визуального стиля (как и остальные картинки)
47) + Сделать кустомайзер
48) - Попробовать слоистую панель там где я раньше удалял и добавлял
49) - Вызывать пак в редакторе границ
50) + Добавить сброс в редактор границ
51) + Добавить класс визуальный стилей "Swing" (Ну там метал,  мотиф и все такое)
52) + Обеспечить выбор периода путем простого протаскивания мышкой (как текст)
53) - Сделать в редакторе представления возможность глобальных изменений
53) + Расширить редактор внешнего вида для возможности создания стилей со свингом
54) + Добавить еще один свинг рисовальщик: панель (для верха и прокрутки)
55) + Баг. Редактор представлений вовсю заглючился.
    a) + После ячейки с курсором отображение переколбашивает (не восстанавливал Stroke после рисования курсора)
    b) + После сохранения формы если было добавлено - исключение (нулпоинтер) (проблема - десериализация)
    c) + Ячейки для свинг представления не редактируются (налажал по полной :) )
56) + Библиотека должна быть запускаемой (кустомайзер и пример), настройки сохранять в XML
    a) + Выбирать компонент с помощью меню 
    b) ? XML сохранение и загрузка - только не XML - а в общем-то нужно будет сделать
    c) + Заставка с прогрессом
57) + Сделать в настройщике и демке нормальный вывод выбранных периодов, когдат их нет (null)
58) + Добавить свойство "Однобуквенные дни недели" (три формата - длинный, короткий, одна буква)
59) - Событие коммит должно происходить не только при выборе одной даты, но и при выборе периода, для 
      модели множественного выбора оно вообще никогда происходить не должно
60) + Подумать над реализацией групировки параметров в кастомайзере - нет сложности и так хватает
61) + Событие "Смещение курсора"
62) + Свойство: разрешить выбирать "ничто (нулл)"
63) + Метод для комбобокса getText()  (еще и setText сделал!)
64) + Компоненты должны рассылать сообщения об изменении свойств, включая панель родитель 
      (выносить свойства не нужно, так как при наследовании указатель будет куда надо)
65) + При нажатом альте - просто перемещать курсор в нужное место без выбора
66) + Двойной щелчок делает коммит
67) + Разобраться со свойствами "Граница" у панели и выпадающего списка - решение: полная независимость друг от друга
68) + Оптимизация создания кастомайзера при запуске (тормозит зараза) - не понадобилось:
    оказывается сам наложал, вместо supportsCustomEditor использовал getCustomEditor == null
69) + UI для панели навигации не обновляется!
70) + И снова баги мля!
    а) + При добавлении профиля внешнего вида список переколбашивает - решил добавил рассылку сообщения в модели списка
    б) + При изменении нового профиля меняется и прошитый (по крайней мере свинг) - рендерер не клонировался
    в) + При выборе ячейки в редакторе - список в ячейке сверху не обновляется - метод onChange висел в воздухе
71) + Баг: Диалог выбора шрифта при появлении показывает прошлый шрифт - проблема в редакторе ячеек вообще - 
    инициализируется прошлым - отнюдь проблема как раз была в редакторах: граница не устанавливалась при открытии
    если была пустой, а панель редактора шрифтов вообще не слушала событий редактора
72) + При стиле Мотиф кнопки смотрятся плохо - просто сделал стартовое окно больше
73) + Сделать класс для ручной загрузки сериализованного набора свойств
74) + По умолчанию - просто ссылка на бывшую вначале границу, а должна быть клоном - убрал по умолчанию вообще - нет в ней 
    смысла при наличии возможностей сбороса каждой границы к начальному состоянию и отмены выбора вообще
75) + Картинка в качестве фона панели выбора даты
    а) + Свойство "Рисунок" (содержит также сведения о расположении: центр, замостить, вписать)
    б) + Добавление полупрозрачности в ячейки, чтобы картинку было видно
76) + Баги
    а) + Обработка ошибок в холдере
    б) + Значение нулл не устанавливается для минимальной и максимальной дат
    в) + Хом и энд нажимаются почему-то два раза - оно от одной кнопки слало два сообщения - с обычной и доп. клавиатур
        (на ноуте). различать такое дело помогает keyEvent.getKeyLocation()
    г) + Отладить предыдущий на обычной клавиатуре
<<<<<Версия 1.1>>>>>
77) + Можно выбирать позицию диалогового окна.
78) + !!!Документация на английском в юникоде!!!.
79) ? Маски ввода для комбы.
80) ? Редакторы ячеек таблицы.


